### Terraform Plan 📋
#### Format: `success`
#### Init: `success`
#### Validate: `success`
#### Plan: `success`

<details><summary>Show Plan</summary>

```
module.dns.data.cloudflare_zone.main: Reading...
module.iam.data.aws_iam_policy_document.ec2_assume_role: Reading...
module.compute.aws_iam_role.scheduler: Refreshing state... [id=bank-onboarding-dev-ec2-scheduler]
module.dns.aws_acm_certificate.main: Refreshing state... [id=arn:aws:acm:us-east-1:260464233931:certificate/86e07f53-79c8-4ea1-85cb-892c06309921]
module.ecr.aws_ecr_repository.backend: Refreshing state... [id=bank-onboarding-dev/backend]
module.cdn.aws_cloudfront_origin_access_control.frontend: Refreshing state... [id=E1BK15JJE3YW2Q]
data.aws_availability_zones.available: Reading...
module.storage.aws_s3_bucket.frontend: Refreshing state... [id=bank-onboarding-dev-frontend]
module.networking.aws_vpc.main: Refreshing state... [id=vpc-053ca2b76874e5fcc]
module.iam.data.aws_iam_policy_document.ec2_assume_role: Read complete after 0s [id=2851119427]
module.api_gateway.aws_apigatewayv2_api.main: Refreshing state... [id=efk4ptkz0m]
module.networking.aws_eip.nat: Refreshing state... [id=eipalloc-04baf96177d3eb864]
module.dns.data.cloudflare_zone.main: Read complete after 0s [id=86bb9d0b6e1d94ff45a41f0ea11050c0]
module.monitoring.aws_sns_topic.alarms: Refreshing state... [id=arn:aws:sns:us-east-1:260464233931:bank-onboarding-dev-alarms]
data.aws_caller_identity.current: Reading...
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.monitoring.aws_cloudwatch_log_group.backend: Refreshing state... [id=/bank-onboarding-dev/backend]
data.aws_caller_identity.current: Read complete after 0s [id=260464233931]
data.aws_ami.amazon_linux_2023: Reading...
module.monitoring.aws_cloudwatch_log_group.api_gateway: Refreshing state... [id=/bank-onboarding-dev/api-gateway]
module.iam.aws_iam_role.ec2: Refreshing state... [id=bank-onboarding-dev-ec2-role]
module.dns.aws_acm_certificate_validation.main: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.dns.cloudflare_record.acm_validation["bank.juancamilofarfan.com"]: Refreshing state... [id=438312c84fd94b44b99a1637753863b4]
module.ecr.aws_ecr_lifecycle_policy.backend: Refreshing state... [id=bank-onboarding-dev/backend]
module.iam.data.aws_iam_policy_document.ecr_pull: Reading...
module.iam.data.aws_iam_policy_document.ecr_pull: Read complete after 0s [id=3697370841]
module.iam.aws_iam_policy.ecr_pull: Refreshing state... [id=arn:aws:iam::260464233931:policy/bank-onboarding-dev-ecr-pull]
module.iam.data.aws_iam_policy_document.cloudwatch_logs: Reading...
module.api_gateway.aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
module.iam.data.aws_iam_policy_document.cloudwatch_logs: Read complete after 0s [id=2831737993]
module.iam.aws_iam_policy.cloudwatch_logs: Refreshing state... [id=arn:aws:iam::260464233931:policy/bank-onboarding-dev-cloudwatch-logs]
module.iam.aws_iam_role_policy_attachment.cloudwatch_agent: Refreshing state... [id=bank-onboarding-dev-ec2-role-20260207222151440300000001]
module.iam.aws_iam_role_policy_attachment.ssm: Refreshing state... [id=bank-onboarding-dev-ec2-role-20260207222151678600000002]
module.iam.aws_iam_instance_profile.ec2: Refreshing state... [id=bank-onboarding-dev-ec2-profile]
module.iam.aws_iam_role_policy_attachment.ecr_pull: Refreshing state... [id=bank-onboarding-dev-ec2-role-20260207222152145400000004]
module.iam.aws_iam_role_policy_attachment.cloudwatch_logs: Refreshing state... [id=bank-onboarding-dev-ec2-role-20260207222151732300000003]
module.storage.aws_s3_bucket_public_access_block.frontend: Refreshing state... [id=bank-onboarding-dev-frontend]
module.storage.aws_s3_bucket_versioning.frontend: Refreshing state... [id=bank-onboarding-dev-frontend]
module.cdn.aws_cloudfront_distribution.main: Refreshing state... [id=E5RYDWL2D0QXC]
data.aws_ami.amazon_linux_2023: Read complete after 1s [id=ami-04fdc0a2bb4908035]
module.cdn.aws_s3_bucket_policy.frontend: Refreshing state... [id=bank-onboarding-dev-frontend]
cloudflare_record.app: Refreshing state... [id=987974df206cd55d8d0e4d74a98d392f]
module.networking.aws_internet_gateway.main: Refreshing state... [id=igw-06597a6fe00670a42]
module.security.aws_security_group.vpc_link: Refreshing state... [id=sg-0fdb8bc25de957951]
module.networking.aws_subnet.private[1]: Refreshing state... [id=subnet-0bf09a6ac934a3cb0]
module.networking.aws_subnet.public[1]: Refreshing state... [id=subnet-005f84fbda9b2b4fe]
module.security.aws_security_group.ec2: Refreshing state... [id=sg-0f22f517dc3d6cbe1]
module.networking.aws_subnet.private[0]: Refreshing state... [id=subnet-09da0a4615c47961e]
module.networking.aws_subnet.public[0]: Refreshing state... [id=subnet-0117e29a8093779e9]
module.networking.aws_route_table.public: Refreshing state... [id=rtb-045ad7c2da1aea55b]
module.security.aws_vpc_security_group_ingress_rule.vpc_link_inbound: Refreshing state... [id=sgr-08a331a5e318bb41c]
module.security.aws_vpc_security_group_egress_rule.vpc_link_to_ec2: Refreshing state... [id=sgr-049e4bfa007b04f43]
module.security.aws_vpc_security_group_egress_rule.ec2_all_out: Refreshing state... [id=sgr-06aed5bc5368778c4]
module.security.aws_vpc_security_group_ingress_rule.ec2_from_vpc_link: Refreshing state... [id=sgr-0efd2556c42329b1b]
module.api_gateway.aws_apigatewayv2_vpc_link.main: Refreshing state... [id=pjk6nk]
module.networking.aws_nat_gateway.main: Refreshing state... [id=nat-08a982ba868a2b9fc]
module.networking.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-008061ca9ff058e1d]
module.networking.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0f0ebcac8afcc2c27]
module.networking.aws_route_table.private: Refreshing state... [id=rtb-0270872c94bae4618]
module.networking.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0f513a1cca3e9e421]
module.networking.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-059d2b69771bda85d]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.api_gateway.aws_apigatewayv2_integration.backend will be created
  + resource "aws_apigatewayv2_integration" "backend" {
      + api_id                                    = "efk4ptkz0m"
      + connection_id                             = "pjk6nk"
      + connection_type                           = "VPC_LINK"
      + id                                        = (known after apply)
      + integration_method                        = "ANY"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "HTTP_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_route.actuator will be created
  + resource "aws_apigatewayv2_route" "actuator" {
      + api_id             = "efk4ptkz0m"
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "GET /actuator/{proxy+}"
      + target             = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_route.api_proxy will be created
  + resource "aws_apigatewayv2_route" "api_proxy" {
      + api_id             = "efk4ptkz0m"
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "ANY /api/{proxy+}"
      + target             = (known after apply)
    }

  # module.compute.aws_iam_role_policy.scheduler will be created
  + resource "aws_iam_role_policy" "scheduler" {
      + id          = (known after apply)
      + name        = "ec2-start-stop"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "bank-onboarding-dev-ec2-scheduler"
    }

  # module.compute.aws_instance.backend will be created
  + resource "aws_instance" "backend" {
      + ami                                  = "ami-04fdc0a2bb4908035"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "bank-onboarding-dev-ec2-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-09da0a4615c47961e"
      + tags                                 = {
          + "Name" = "bank-onboarding-dev-backend"
        }
      + tags_all                             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "bank-onboarding-dev-backend"
          + "Project"     = "bank-onboarding"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (sensitive value)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-0f22f517dc3d6cbe1",
        ]

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 30
          + volume_type           = "gp3"
        }
    }

  # module.compute.aws_scheduler_schedule.start_ec2 will be created
  + resource "aws_scheduler_schedule" "start_ec2" {
      + arn                          = (known after apply)
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "bank-onboarding-dev-start-ec2"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0 8 ? * MON-FRI *)"
      + schedule_expression_timezone = "America/Bogota"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:ec2:startInstances"
          + input    = (known after apply)
          + role_arn = "arn:aws:iam::260464233931:role/bank-onboarding-dev-ec2-scheduler"
        }
    }

  # module.compute.aws_scheduler_schedule.stop_ec2 will be created
  + resource "aws_scheduler_schedule" "stop_ec2" {
      + arn                          = (known after apply)
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "bank-onboarding-dev-stop-ec2"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0 17 ? * MON-FRI *)"
      + schedule_expression_timezone = "America/Bogota"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:ec2:stopInstances"
          + input    = (known after apply)
          + role_arn = "arn:aws:iam::260464233931:role/bank-onboarding-dev-ec2-scheduler"
        }
    }

  # module.monitoring.aws_cloudwatch_metric_alarm.cpu_high will be created
  + resource "aws_cloudwatch_metric_alarm" "cpu_high" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:260464233931:bank-onboarding-dev-alarms",
        ]
      + alarm_description                     = "EC2 CPU usage above 80% for 10 minutes"
      + alarm_name                            = "bank-onboarding-dev-cpu-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "cpu_usage_active"
      + namespace                             = "bank-onboarding-dev/CWAgent"
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "Name" = "bank-onboarding-dev-cpu-alarm"
        }
      + tags_all                              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "bank-onboarding-dev-cpu-alarm"
          + "Project"     = "bank-onboarding"
        }
      + threshold                             = 80
      + treat_missing_data                    = "missing"
    }

  # module.monitoring.aws_cloudwatch_metric_alarm.memory_high will be created
  + resource "aws_cloudwatch_metric_alarm" "memory_high" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:260464233931:bank-onboarding-dev-alarms",
        ]
      + alarm_description                     = "EC2 memory usage above 85% for 10 minutes"
      + alarm_name                            = "bank-onboarding-dev-memory-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "mem_used_percent"
      + namespace                             = "bank-onboarding-dev/CWAgent"
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "Name" = "bank-onboarding-dev-memory-alarm"
        }
      + tags_all                              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "bank-onboarding-dev-memory-alarm"
          + "Project"     = "bank-onboarding"
        }
      + threshold                             = 85
      + treat_missing_data                    = "missing"
    }

  # module.monitoring.aws_cloudwatch_metric_alarm.status_check will be created
  + resource "aws_cloudwatch_metric_alarm" "status_check" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:260464233931:bank-onboarding-dev-alarms",
        ]
      + alarm_description                     = "EC2 instance status check failed"
      + alarm_name                            = "bank-onboarding-dev-status-check"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "StatusCheckFailed"
      + namespace                             = "AWS/EC2"
      + period                                = 60
      + statistic                             = "Maximum"
      + tags                                  = {
          + "Name" = "bank-onboarding-dev-status-alarm"
        }
      + tags_all                              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "bank-onboarding-dev-status-alarm"
          + "Project"     = "bank-onboarding"
        }
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ec2_instance_id            = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @juancadev-io, Action: `pull_request`*